# Напишите программу, которая принимает на вход число N и выдаёт
# последовательность из N членов.

print(list(map(lambda i: (-3)**i, [x for x in range(5)])))